Repository: Reload8686/opt
Catalog: ubuntu-make/po/*.po
Languages: fr

source: # Ubuntu make installation of {}
fr: # Ajouté par Ubuntu make de {}

source: * Command '{}':
fr: * Commande '{}':

source: Deploy and setup developers environment easily on ubuntu
fr: Installez et déployez un environnement de développement facilement sur ubuntu

source: Note that you can also configure different debug logging behavior using LOG_CFG that points to a log yaml profile.
fr: Il est également possible de configurer différents comportements et niveaux de logs en faisant pointer la variable d'environnement LOG_CFG vers un fichier de profile de log yaml.

source: Show this help
fr: Afficher cette aide

source: Increase output verbosity (2 levels)
fr: Augmenter la verbosité de la sortie (2 niveaux)

source: Remove specified framework if installed
fr: Supprimer un environnement spécifique si installé

source: Print version and exit
fr: Afficher la version et quitter

source: Generic IDEs
fr: Environnement de développement intégré

source: Pure Eclipse Luna (4.4)
fr: Eclipse Luna (4.4)

source: The Eclipse Luna Integrated Development Environment
fr: L'environnement de développement intégré Eclipse Luna

source: PyCharm Community Edition
fr: Pycharm Édition Communautaire

source: PyCharm Educational Edition
fr: PyCharm Édition Éducation

source: PyCharm Professional Edition
fr: PyCharm Édition Professionelle

source: IntelliJ IDEA Community Edition
fr: IntelliJ IDEA Édition Communautaire

source: Ruby on Rails IDE
fr: IDE Ruby on Rails

source: Complex client-side and server-side javascript IDE
fr: IDE pour le développement d'applications javascript clientes et server

source: PHP and web development IDE
fr: IDE pour PHP et web

source: CLion integrated C/C++ IDE
fr: IDE C/C++ CLion

source: The Arduino Software Distribution
fr: Logiciels pour Arduino

source: The Arduino Software IDE
fr: IDE pour Arduino

source: You need to logout and login again for your installation to work
fr: We devez vous déconnecter et vous reconnecter pour que votre installation fonctionne

source: Netbeans IDE
fr: IDE Netbeans

source: Dartlang Development Environment
fr: Environnement de Développement Dartlang

source: Dart SDK with editor (not supported upstream anyymore)
fr: Dart SDK avec éditeur (non supporté par upstream)

source: Dart SDK (default)
fr: Dart SDK (défault)

source: You need to restart your current shell session for your {} installation to work properly
fr: Vous devez redémarrer votre shell courant pour que votre installation {} fonctionne

source: Rust language
fr: Langage Rust

source: The official Rust distribution
fr: Distribution officielle Rust

source: The Scala Programming Language
fr: Langage Scala

source: Scala compiler and interpreter (default)
fr: Compilateur et interpréteur Scala (défaut)

source: Go language
fr: Langage Go

source: Google compiler (default)
fr: Compilateur Google (défaut)

source: Android Development Environment
fr: Environnement de développement Android

source: Android Studio (default)
fr: Android Studio (défaut)

source: Android Studio developer environment
fr: Environnement de développement Android Studio

source: Android SDK
fr: SDK Android

source: A default framework for category {} was requested where there is none
fr: Un framework par défaut pour la catégorie {} a été demandée, mais il n'y en a aucun

source: You can't install that framework on this machine
fr: Vous ne pouvez pas installer ce framework sur cette machine

source: You can't remove {} as it isn't installed
fr: Vous ne pouvez supprimer {} puisqu'il n'est pas installé

source: If the default framework name isn't provided, destdir should contain a /
fr: Si l'environnement par défaut n'est pas spécifié, destdir doit contenir un /

source: Remove framework if installed
fr: Supprime l'environnement si installé

source: Accept license without prompting
fr: Accepter la license sans demander

source: Web Developer Environment
fr: Environnement de développement Web

source: Firefox Developer Edition
fr: Firefox Édition Développeur

source: Choose language: {}
fr: Votre langue : {}

source: Firefox Aurora with Developer tools
fr: Firefox Aurora avec outils développeur

source: Install in given language without prompting
fr: Installer dans la lange choisie sans demander

source: Visual Studio focused on modern web and cloud
fr: Visual Studio pour le web moderne et cloud

source: Games Development Environment
fr: Environnement de développement de jeux

source: Stencyl game developer IDE
fr: Éditeur de jeux Stencyl

source: Unity 3D Editor Linux experimental support
fr: Éditeur Unity 3D avec support expérimental pour Linux

source: Unity3D Editor
fr: Éditeur Unity 3D

source: Twine tool for creating interactive and nonlinear stories
fr: Outil Twine de création interactive et non linéaire d'histoires

source: No suitable answer provided
fr: La réponse n'est pas satisfaisante

source: Your entry '{}' isn't an acceptable choice. choices are: {}
fr: Votre entrée '{}' n'est pas un choix acceptable. Choisissez parmi: {}

source: Your entry '{}' isn't an acceptable choice. choices are: {} and {}
fr: Votre entrée '{}' n'est pas un choix acceptable. Choisissez entre {} et {}

source: I Accept
fr: J'accepte

source: I don't accept
fr: Je ne les accepte pas

source: Yes
fr: Oui

source: y
fr: o

source: No
fr: Non
